[Killed] BlockStatement
src/operacoes.js:19:22
 function restoDivisao(dividendo, divisor) { return dividendo % divisor; }
 
 // Versão final refatorada do Fatorial (remove 'if' redundante)
-function fatorial(n) {
-  if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
-  let resultado = 1;
-  for (let i = 2; i <= n; i++) {
-    resultado *= i;
-  }
-  return resultado;
-}
+function fatorial(n) {}
 
 function mediaArray(numeros) {
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js

  Suíte de Testes Robusta para 50 Operações Aritméticas

[Killed] EqualityOperator
src/operacoes.js:22:19
 function fatorial(n) {
   if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
   let resultado = 1;
-  for (let i = 2; i <= n; i++) {
+  for (let i = 2; i < n; i++) {
     resultado *= i;
   }
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js

  Suíte de Testes Robusta para 50 Operações Aritméticas

[Killed] BlockStatement
src/operacoes.js:28:30
   return resultado;
 }
 
-function mediaArray(numeros) {
-  if (numeros.length === 0) return 0;
-  return somaArray(numeros) / numeros.length;
-}
+function mediaArray(numeros) {}
 function somaArray(numeros) {
   return numeros.reduce((acc, val) => acc + val, 0);
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js

  Suíte de Testes Robusta para 50 Operações Aritméticas

[Killed] BlockStatement
src/operacoes.js:37:31
 }
 
 // === Bloco 2: Operações em Arrays e Checagens (11-20) ===
-function maximoArray(numeros) {
-  // CORRIGIDO: "не" -> "não"
-  if (numeros.length === 0) throw new Error('Array vazio não possui valor máximo.');
-  return Math.max(...numeros);
-}
+function maximoArray(numeros) {}
 function minimoArray(numeros) {
   // CORRIGIDO: "не" -> "não"
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js

  Suíte de Testes Robusta para 50 Operações Aritméticas

[Killed] EqualityOperator
src/operacoes.js:39:7
 // === Bloco 2: Operações em Arrays e Checagens (11-20) ===
 function maximoArray(numeros) {
   // CORRIGIDO: "не" -> "não"
-  if (numeros.length === 0) throw new Error('Array vazio não possui valor máximo.');
+  if (numeros.length !== 0) throw new Error('Array vazio não possui valor máximo.');
   return Math.max(...numeros);
 }
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js

  Suíte de Testes Robusta para 50 Operações Aritméticas

[Killed] ConditionalExpression
src/operacoes.js:39:7
 // === Bloco 2: Operações em Arrays e Checagens (11-20) ===
 function maximoArray(numeros) {
   // CORRIGIDO: "не" -> "não"
-  if (numeros.length === 0) throw new Error('Array vazio não possui valor máximo.');
+  if (true) throw new Error('Array vazio não possui valor máximo.');
   return Math.max(...numeros);
 }
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js
  Suíte de Testes Robusta para 50 Operações Aritméticas
    √ 1. deve somar dois números (positivos, negativos e zero) (4 ms)
    √ 2. deve subtrair dois números

[Killed] MethodExpression
src/operacoes.js:40:10
 function maximoArray(numeros) {
   // CORRIGIDO: "не" -> "não"
   if (numeros.length === 0) throw new Error('Array vazio não possui valor máximo.');
-  return Math.max(...numeros);
+  return Math.min(...numeros);
 }
 function minimoArray(numeros) {
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js

  Suíte de Testes Robusta para 50 Operações Aritméticas

[Killed] BlockStatement
src/operacoes.js:42:31
   if (numeros.length === 0) throw new Error('Array vazio não possui valor máximo.');
   return Math.max(...numeros);
 }
-function minimoArray(numeros) {
-  // CORRIGIDO: "не" -> "não"
-  if (numeros.length === 0) throw new Error('Array vazio não possui valor mínimo.');
-  return Math.min(...numeros);
-}
+function minimoArray(numeros) {}
 function valorAbsoluto(n) { return Math.abs(n); }
 function arredondar(n) { return Math.round(n); }
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js

  Suíte de Testes Robusta para 50 Operações Aritméticas

[Killed] ConditionalExpression
src/operacoes.js:44:7
 }
 function minimoArray(numeros) {
   // CORRIGIDO: "не" -> "não"
-  if (numeros.length === 0) throw new Error('Array vazio não possui valor mínimo.');
+  if (false) throw new Error('Array vazio não possui valor mínimo.');
   return Math.min(...numeros);
 }
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js
  Suíte de Testes Robusta para 50 Operações Aritméticas
    √ 1. deve somar dois números (positivos, negativos e zero) (4 ms)
    √ 2. deve subtrair dois números (1 ms)

[Killed] ConditionalExpression
src/operacoes.js:44:7
 }
 function minimoArray(numeros) {
   // CORRIGIDO: "не" -> "não"
-  if (numeros.length === 0) throw new Error('Array vazio não possui valor mínimo.');
+  if (true) throw new Error('Array vazio não possui valor mínimo.');
   return Math.min(...numeros);
 }
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js
  Suíte de Testes Robusta para 50 Operações Aritméticas
    √ 1. deve somar dois números (positivos, negativos e zero) (3 ms)
    √ 2. deve subtrair dois números

[Killed] MethodExpression
src/operacoes.js:45:10
 function minimoArray(numeros) {
   // CORRIGIDO: "не" -> "não"
   if (numeros.length === 0) throw new Error('Array vazio não possui valor mínimo.');
-  return Math.min(...numeros);
+  return Math.max(...numeros);
 }
 function valorAbsoluto(n) { return Math.abs(n); }
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js

  Suíte de Testes Robusta para 50 Operações Aritméticas

[Killed] ConditionalExpression
src/operacoes.js:81:9
 function isPrimo(n) {
   if (n <= 1) return false;
   for (let i = 2; i < n; i++) {
-    if (n % i === 0) return false;
+    if (false) return false;
   }
   return true;
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js

  Suíte de Testes Robusta para 50 Operações Aritméticas

[Killed] BlockStatement
src/operacoes.js:91:32
 }
 
 // Versão final refatorada do produtoArray (remove 'if' redundante)
-function produtoArray(numeros) {
-  return numeros.reduce((acc, val) => acc * val, 1);
-}
+function produtoArray(numeros) {}
 
 function clamp(valor, min, max) {
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js

  Suíte de Testes Robusta para 50 Operações Aritméticas

[Killed] BlockStatement
src/operacoes.js:95:33
   return numeros.reduce((acc, val) => acc * val, 1);
 }
 
-function clamp(valor, min, max) {
-  if (valor < min) return min;
-  if (valor > max) return max;
-  return valor;
-}
+function clamp(valor, min, max) {}
 function isDivisivel(dividendo, divisor) { return dividendo % divisor === 0; }
 function celsiusParaFahrenheit(celsius) { return (celsius * 9/5) + 32; }
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js

  Suíte de Testes Robusta para 50 Operações Aritméticas

[Killed] BlockStatement
src/operacoes.js:100:42
   if (valor > max) return max;
   return valor;
 }
-function isDivisivel(dividendo, divisor) { return dividendo % divisor === 0; }
+function isDivisivel(dividendo, divisor) {}
 function celsiusParaFahrenheit(celsius) { return (celsius * 9/5) + 32; }
 function fahrenheitParaCelsius(fahrenheit) { return (fahrenheit - 32) * 5/9; }
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js

  Suíte de Testes Robusta para 50 Operações Aritméticas

[Killed] ConditionalExpression
src/operacoes.js:112:36
 function areaCirculo(raio) { return Math.PI * Math.pow(raio, 2); }
 function areaRetangulo(base, altura) { return base * altura; }
 function perimetroRetangulo(base, altura) { return 2 * (base + altura); }
-function isMaiorQue(a, b) { return a > b; }
+function isMaiorQue(a, b) { return true; }
 function isMenorQue(a, b) { return a < b; }
 function isEqual(a, b) { return a === b; }
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js

  Suíte de Testes Robusta para 50 Operações Aritméticas

[Killed] ConditionalExpression
src/operacoes.js:113:36
 function areaRetangulo(base, altura) { return base * altura; }
 function perimetroRetangulo(base, altura) { return 2 * (base + altura); }
 function isMaiorQue(a, b) { return a > b; }
-function isMenorQue(a, b) { return a < b; }
+function isMenorQue(a, b) { return true; }
 function isEqual(a, b) { return a === b; }
 function medianaArray(numeros) {
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js

  Suíte de Testes Robusta para 50 Operações Aritméticas

[Killed] EqualityOperator
src/operacoes.js:113:36
 function areaRetangulo(base, altura) { return base * altura; }
 function perimetroRetangulo(base, altura) { return 2 * (base + altura); }
 function isMaiorQue(a, b) { return a > b; }
-function isMenorQue(a, b) { return a < b; }
+function isMenorQue(a, b) { return a >= b; }
 function isEqual(a, b) { return a === b; }
 function medianaArray(numeros) {
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js

  Suíte de Testes Robusta para 50 Operações Aritméticas

[Killed] ConditionalExpression
src/operacoes.js:114:33
 function perimetroRetangulo(base, altura) { return 2 * (base + altura); }
 function isMaiorQue(a, b) { return a > b; }
 function isMenorQue(a, b) { return a < b; }
-function isEqual(a, b) { return a === b; }
+function isEqual(a, b) { return false; }
 function medianaArray(numeros) {
   // CORRIGIDO: "не" -> "não"
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js

  Suíte de Testes Robusta para 50 Operações Aritméticas

[Killed] BlockStatement
src/operacoes.js:115:32
 function isMaiorQue(a, b) { return a > b; }
 function isMenorQue(a, b) { return a < b; }
 function isEqual(a, b) { return a === b; }
-function medianaArray(numeros) {
-  // CORRIGIDO: "не" -> "não"
-  if (numeros.length === 0) throw new Error('Array vazio não possui mediana.');
-  const sorted = [...numeros].sort((a, b) => a - b);
-  const mid = Math.floor(sorted.length / 2);
-  if (sorted.length % 2 === 0) {
-    return (sorted[mid - 1] + sorted[mid]) / 2;
-  }
-  return sorted[mid];
-}
+function medianaArray(numeros) {}
 function dobro(n) { return n * 2; }
 function triplo(n) { return n * 3; }
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js

  Suíte de Testes Robusta para 50 Operações Aritméticas

[Killed] ConditionalExpression
src/operacoes.js:117:7
 function isEqual(a, b) { return a === b; }
 function medianaArray(numeros) {
   // CORRIGIDO: "не" -> "não"
-  if (numeros.length === 0) throw new Error('Array vazio não possui mediana.');
+  if (false) throw new Error('Array vazio não possui mediana.');
   const sorted = [...numeros].sort((a, b) => a - b);
   const mid = Math.floor(sorted.length / 2);
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js

  Suíte de Testes Robusta para 50 Operações Aritméticas

[Killed] ConditionalExpression
src/operacoes.js:117:7
 function isEqual(a, b) { return a === b; }
 function medianaArray(numeros) {
   // CORRIGIDO: "не" -> "não"
-  if (numeros.length === 0) throw new Error('Array vazio não possui mediana.');
+  if (true) throw new Error('Array vazio não possui mediana.');
   const sorted = [...numeros].sort((a, b) => a - b);
   const mid = Math.floor(sorted.length / 2);
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js

  Suíte de Testes Robusta para 50 Operações Aritméticas

[Killed] ArrowFunction
src/operacoes.js:118:36
 function medianaArray(numeros) {
   // CORRIGIDO: "не" -> "não"
   if (numeros.length === 0) throw new Error('Array vazio não possui mediana.');
-  const sorted = [...numeros].sort((a, b) => a - b);
+  const sorted = [...numeros].sort(() => undefined);
   const mid = Math.floor(sorted.length / 2);
   if (sorted.length % 2 === 0) {
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js

  Suíte de Testes Robusta para 50 Operações Aritméticas

[Killed] MethodExpression
src/operacoes.js:118:18
 function medianaArray(numeros) {
   // CORRIGIDO: "не" -> "não"
   if (numeros.length === 0) throw new Error('Array vazio não possui mediana.');
-  const sorted = [...numeros].sort((a, b) => a - b);
+  const sorted = [...numeros];
   const mid = Math.floor(sorted.length / 2);
   if (sorted.length % 2 === 0) {
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js
  Suíte de Testes Robusta para 50 Operações Aritméticas
    √ 1. deve somar dois números (positivos, negativos e zero) (3 ms)
    √ 2. deve subtrair dois números
